#include <stdio.h>
#include <locale.h>

int main()
{
	setlocale(LC_ALL, "RUSSIAN");
	char name1[10], name2[10];
	float s;
	char number;
	fgets(name1, 10, stdin);
	fgets(name2, 10, stdin);
	scanf_s("%f %c", &s, &number);
	printf(" --------------------------------------------------------------------------------------------------------\n"
		"|Сельскохозяйственные предприятия                                                                        |\n"
		"|--------------------------------------------------------------------------------------------------------|\n"
		"|Название  |Вид собственности    | Площадь земли (га)  | Кол. работников                                 |\n"
		"|----------|---------------------|---------------------|-------------------------------------------------|\n"
		"|    %s    |         %s          |        %f           |                %c                               |\n"
		"|----------|---------------------|---------------------|-------------------------------------------------|\n", name1, name2, s, number);
	return 0;
}